app/controllers/campaigns_controller.rb

INSERT INTO "campaigns" ("title", "description", "goal", "end_date", "created_at", "updated_at", "aasm_state", "address", "longitude", "latitude") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
INSERT INTO "rewards" ("title", "body", "amount", "campaign_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Pony toy"], ["body", "So that is a toy for a reward"], ["amount", 5], ["campaign_id", 3], ["created_at", 2016-09-22 21:07:09 UTC], ["updated_at", 2016-09-22 21:07:09 UTC]]
---
  def create
    # codes below is hindering the testing for invalid_request so we block it out
    # @campaign = Campaign.create params.require(:campaign).permit(:title, :description, :goal, :end_date)

    # redirect_to campaign_path(@campaign), notice: "Campaign created!"


    @campaign = Campaign.new params.require(:campaign).permit(:title, :description, :goal, :address, :end_date, {rewards_attributes: [:title, :body, :amount, :_destroy, :id]})

    if @campaign.save

SELECT  "campaigns".* FROM "campaigns" WHERE "campaigns"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def show
    @campaign = Campaign.find params[:id]

SELECT  "campaigns".* FROM "campaigns" WHERE ("campaigns"."latitude" IS NOT NULL) AND ("campaigns"."longitude" IS NOT NULL) ORDER BY "campaigns"."created_at" ASC LIMIT $1  [["LIMIT", 30]]
---
  def index
    if params[:lat]
      @campaigns = Campaign.near([params[:lat], params[:lng]], 50, units: :km)
    else
      @campaigns = Campaign.where.not(latitude: nil, longitude: nil).order(:created_at).limit(30)

SELECT  "campaigns".* FROM "campaigns" WHERE "campaigns"."id" = $1 LIMIT $2  [["id", 54], ["LIMIT", 1]]
DELETE FROM "campaigns" WHERE "campaigns"."id" = $1  [["id", 54]]
---
  def destroy
    campaign = Campaign.find params[:id]
    campaign.destroy