app/controllers/payments_controller.rb

SELECT  "pledges".* FROM "pledges" WHERE "pledges"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def new
    @pledge = Pledge.find params[:pledge_id]

SELECT  "pledges".* FROM "pledges" WHERE "pledges"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def create
    pledge = Pledge.find params[:pledge_id]