app/controllers/pledges_controller.rb

SELECT  "campaigns".* FROM "campaigns" WHERE "campaigns"."id" = $1 LIMIT $2  [["id", 180], ["LIMIT", 1]]
INSERT INTO "pledges" ("amount", "user_id", "campaign_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["amount", 15], ["user_id", 4], ["campaign_id", 180], ["created_at", 2016-10-06 21:21:45 UTC], ["updated_at", 2016-10-06 21:21:45 UTC]]
---
  def create
    @pledge = Pledge.new pledge_params
    @campaign = Campaign.find params[:campaign_id]
    @pledge.campaign = @campaign
    @pledge.user = current_user
    if @pledge.save

SELECT  "pledges".* FROM "pledges" WHERE "pledges"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
DELETE FROM "pledges" WHERE "pledges"."id" = $1  [["id", 10]]
---
  def destroy
    pledge = Pledge.find params[:id]
    pledge.destroy