app/controllers/publishings_controller.rb

  def create
    campaign = Campaign.find params[:campaign_id]
---
SELECT  "campaigns".* FROM "campaigns" WHERE "campaigns"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]