app/views/campaigns/show.html.erb

SELECT "rewards".* FROM "rewards" WHERE "rewards"."campaign_id" = $1  [["campaign_id", 4]]
---

<% @campaign.rewards.each do |reward| %>